---
kind: method
id: M:Autodesk.Revit.DB.SpotDimension.Flip
source: html/f12f812e-64ce-1421-63fc-34ce0ecc51b1.htm
---
# Autodesk.Revit.DB.SpotDimension.Flip Method

Flips dimension to the other side of the host.

## Syntax (C#)
```csharp
public void Flip()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - SpotDimension cannot be flipped.